app/controllers/exames_controller.rb

  def index
    @exames = Exame.all
---
SELECT `exames`.* FROM `exames`