app/controllers/medicamentos_controller.rb

SELECT `medicamentos`.* FROM `medicamentos`
---
  def index
    @medicamentos = Medicamento.all