app/controllers/racas_controller.rb

SELECT `racas`.* FROM `racas`
---
  def index
    @racas = Raca.all

INSERT INTO `racas` (`created_at`, `raca`, `updated_at`) VALUES ('2014-03-15 16:08:54', 'olandeza', '2014-03-15 16:08:54')
---
  def create
    @raca = Raca.new(raca_params)

    respond_to do |format|
      if @raca.save

DELETE FROM `racas` WHERE `racas`.`id` = 1
---
  def destroy
    @raca.destroy

SELECT `racas`.* FROM `racas` WHERE `racas`.`id` = 1 LIMIT 1
---
    def set_raca
      @raca = Raca.find(params[:id])