app/controllers/tipo_vacinas_controller.rb

  def index
    @tipo_vacinas = TipoVacina.all
---
SELECT `tipo_vacinas`.* FROM `tipo_vacinas`

  def create
    @tipo_vacina = TipoVacina.new(tipo_vacina_params)

    respond_to do |format|
      if @tipo_vacina.save
---
INSERT INTO `tipo_vacinas` (`created_at`, `tipo_vacina`, `updated_at`) VALUES ('2014-03-15 16:04:17', 'musculo', '2014-03-15 16:04:17')

  def destroy
    @tipo_vacina.destroy
---
DELETE FROM `tipo_vacinas` WHERE `tipo_vacinas`.`id` = 1

    def set_tipo_vacina
      @tipo_vacina = TipoVacina.find(params[:id])
---
SELECT `tipo_vacinas`.* FROM `tipo_vacinas` WHERE `tipo_vacinas`.`id` = 1 LIMIT 1