app/controllers/tipo_exames_controller.rb

  def index
    @tipo_exames = TipoExame.all
---
SELECT `tipo_exames`.* FROM `tipo_exames`

  def create
    @tipo_exame = TipoExame.new(tipo_exame_params)

    respond_to do |format|
      if @tipo_exame.save
---
INSERT INTO `tipo_exames` (`created_at`, `tipo_exame`, `updated_at`) VALUES ('2014-03-15 23:11:52', 's', '2014-03-15 23:11:52')

  def destroy
    @tipo_exame.destroy
---
DELETE FROM `tipo_exames` WHERE `tipo_exames`.`id` = 1

    def set_tipo_exame
      @tipo_exame = TipoExame.find(params[:id])
---
SELECT `tipo_exames`.* FROM `tipo_exames` WHERE `tipo_exames`.`id` = 1 LIMIT 1