app/controllers/tipo_medicamentos_controller.rb

  def index
    @tipo_medicamentos = TipoMedicamento.all
---
SELECT `tipo_medicamentos`.* FROM `tipo_medicamentos`