app/controllers/vacinas_controller.rb

  def index
    @vacinas = Vacina.all
---
SELECT `vacinas`.* FROM `vacinas`